// Третья группа методов что-то возвращает, но ничего не принимает
int Method3() // не принимает никаких аргументов
{
    return DateTime.Now.Year;//обязательно используем оператора return.
}
int year = Method3(); //вызываем метод, в левой части используем идентификатор
// переменной Year и через оператор присваивания (=) кладем нужное значение
Console.WriteLine(year);// То есть return DataTime.Now>Year провел какую-то
//работу и в переменную Year будет положен результат работы метода.
//Дальше мы можем его использовать
