// Вторая группа методоа
//void Metod2 (string msg)//void ключевое слово, дальше индификатор,
// в скобках указан принятый аргумент
//{
//    Console.WriteLine(msg);//- оператор, в скобках указан принятый аргумент
//}
//Metod2("I love your my soul");//Metod2 является индефикатором, а в скобках
//указан текст, выводимый в консоле.
//Именованные аргументы - когда у нас явно может быть указано какому аргументу
//какое значение мы хотим указать. Это часто бывает нужно, если методы
// принимают како-то кол-во аргументов, отличное от 1..
void Metod21 (string msg, int count)
{
    int i = 0;
    while (i < count)
    {
        Console.WriteLine(msg);//где переменная count отображает на экране
        //определенное кол-во сообщений msg
        i++;
    }
}
//Metod21("I love your my soul", 4);
Metod21(msg:"I love your my soul",count: 4);//. вызывает.
//число после запятой указывает кол-во вызывов. Переменная count, чтобы
//показывать на экране определенное кол-во сообщений, которые будут 
//передаваться непосредственно в наш метод. Увеличение счетчика на 1 ->
//инкремент, уменьшение на 1 -> декремент.
